# -*- coding: utf-8 -*-
from __future__ import unicode_literals
from django.utils.translation import ugettext_lazy as _

TRIGGER_TYPE = (
    ('open', _(u'任务触发器')),
    ('birthday', _(u'生日触发器')),
    ('holiday', _(u'节假日触发器')),
    # ('subscribe', _(u'订阅触发器')),
)

MAILLIST_TYPE = (
    ('all', _(u'全部地址分类')),
    ('part', _(u'部分地址分类')),
)

EXPIRE_TYPE = (
    ('forever', _(u'永久')),
    ('custom', _(u'自定义时间')),
)

TRIGGER_CONDITION = (
    ('open', _(u'打开任务时')),
    ('click', _(u'点击任务时')),
    ('unsubscribe', _(u'点击任务中退订链接时')),
    ('birthday', _(u'到生日日期时')),
    ('holiday', _(u'到指定节假日日期时')),
    ('subscribe', _(u'加入到订阅列表时')),
)

TRIGGER_STATUS = (
    ('enable', _(u'启用')),
    ('disable', _(u'禁用')),
    #('expired', _(u'已过期'))
)

TRIGGERACTION_STATUS = (
    ('enable', _(u'正常')),
    ('delete', _(u'删除'))
)

IS_PERMANENT = (
    ('1', _(u'永久')),
    ('0', _(u'自定义有效期时间')),
)

MAIL_TYPR = (
    ('1', _(u'全部地址分类')),
    ('0', _(u'部分地址分类')),
)

SEND_ACCT_TYPE = (
    ('all', _(u'所有域名')),
    ('domain', _(u'单个域名')),
)

TRACK_STATUS = (
    (0, _(u'不跟踪')),
    (1, _(u'跟踪邮件打开情况')),
    (2, _(u'跟踪邮件打开与链接点击情况')),
)

EXPIRE_CHOICE =  (
    ('1', u'永久'),
    ('0', u'自定义时间')
)

ACTION_SCHEDULE = (
    ('immediately', _(u'立即触发')),
    ('delay', _(u'延迟触发')),
    ('advance', _(u'提前触发')),
)
TIME_TYPE = (
    ('min', _(u'分钟')),
    ('hou', _(u'小时')),
    ('day', _(u'天')),
)

TRIGGER_TASK_STATUS = (
    ('wait', _(u'等待触发')),
    ('doing', _(u'触发中')),
    ('done', _(u'已触发')),
)

############################################################
# 邮件随机字符串变量
CNCHARS = ["鲁", "迅", "又", "谈", "到", "他", "把", "狂", "人", "日",
           "记", "等", "小", "说", "投", "稿", "新", "青", "年", "的",
           "经", "过", "曾", "问", "办", "朋", "友", "假", "如", "一",
           "间", "铁", "屋", "子", "是", "绝", "无", "窗", "户", "而",
           "万", "难", "破", "毁", "里", "面", "有", "许", "多", "熟",
           "睡", "们", "不", "久", "都", "要", "闷", "死", "了", "然",
           "从", "昏", "感", "就", "悲", "哀", "现", "在", "灭", "你",
           "大", "嚷", "起", "来", "惊", "较", "为", "清", "醒", "几",
           "个", "使", "这", "幸", "少", "数", "者", "受", "可", "挽",
           "救", "临", "终", "苦", "楚", "倒", "以", "对", "得", "么",
           "那", "答", "道", "既", "能", "决", "没", "坏", "希", "望",
           "于", "便", "写", "此", "后", "还", "陆", "续", "推", "出",
           "另", "外", "十", "余", "篇", "自", "己", "作", "品", "叫",
           "国", "本", "已", "并", "非", "切", "迫", "言", "收", "入",
           "先", "生", "且", "用", "象", "征", "主", "义", "手", "法",
           "含", "双", "关", "表", "述", "产", "极", "强", "艺", "术",
           "染", "力", "着", "反", "映", "妇", "女", "惨", "命", "运",
           "之", "通", "寡", "单", "四", "嫂", "痛", "失", "独", "描",
           "令", "震", "悚", "地", "展", "示", "幅", "中", "孤", "立",
           "助", "图", "景", "孔", "乙", "塑", "造", "封", "建", "社",
           "会", "落", "知", "识", "分", "典", "型", "形", "特", "色",
           "结", "构", "严", "谨", "加", "工", "和", "创", "成", "革",
           "民", "众", "流", "血", "牺", "牲", "被", "所", "理", "解",
           "深", "省", "剖", "析", "辛", "亥", "功", "历", "史", "原",
           "因", "其", "意", "蕴", "丰", "富", "长", "洋", "鬼", "阶",
           "级", "家", "庭", "身", "资", "机", "王", "胡", "赵", "司",
           "晨", "弱", "肉", "食", "折", "射", "同", "时", "也", "增",
           "勇", "气", "喝", "酒", "看", "笑", "每", "口", "似", "乎",
           "蓝", "皮", "阿", "五", "声", "音", "候", "虽", "很", "降",
           "下", "员", "天", "将", "却", "愿", "乳", "房", "孩", "目",
           "批", "判", "性", "揭", "露", "任", "何", "具", "体", "物",
           "暗", "引", "发", "尖", "恐", "怖", "画", "央", "毛", "骨",
           "正", "我", "边", "走", "转", "向", "伸", "远", "处", "栏",
           "杆", "高", "度", "夸", "张", "蒙", "克", "彩", "与", "保",
           "持", "定", "程", "联", "样", "紫", "空", "水", "扭", "动",
           "曲", "线", "桥", "粗", "壮", "挺", "直", "斜", "式", "鲜",
           "明", "比", "种", "波", "像", "化", "或", "凡", "名", "量",
           "相", "系", "由", "内", "焦", "虑", "尽", "头", "缘", "觉",
           "回", "忆", "旋", "围", "绕", "晴", "朗", "蔚", "心", "好",
           "黑", "消", "荒", "刻", "哭", "诉", "恶", "噩", "哪", "平",
           "静", "踏", "上", "步", "愤", "怨", "领", "导", "存", "谁",
           "亦", "迷", "途", "愁", "泪", "做", "信", "怯", "摇", "繁",
           "盛", "萧", "条", "患", "病", "治", "疗", "著", "旧", "去",
           "见", "证", "致", "敬", "亢", "奋", "蹦", "跳", "渐", "厂",
           "舍", "兴", "沿", "岸", "鱼", "村", "洩", "振", "再", "进",
           "唱", "调", "它", "永", "最", "朴", "素", "笔", "耐", "颗",
           "浮", "华", "搭", "坛", "让", "灯", "初", "街", "方", "宁",
           "想", "梦", "第", "次", "认", "学", "报", "纸", "登", "载",
           "某", "校", "座", "讲", "话", "更", "事", "只", "残", "疾",
           "仍", "耕", "辍", "激", "励", "鼓", "逆", "境", "屈", "挠"]