#coding=utf-8

AREA_CONF = (
    (u'北京', u'北京'),
    (u'上海', u'上海'),
    (u'天津', u'天津'),
    (u'广东', u'广东'),
    (u'内蒙古', u'内蒙古'),
    (u'山西', u'山西'),
    (u'河北', u'河北'),
    (u'辽宁', u'辽宁'),
    (u'吉林', u'吉林'),
    (u'黑龙江', u'黑龙江'),
    (u'江苏', u'江苏'),
    (u'安徽', u'安徽'),
    (u'山东', u'山东'),
    (u'浙江', u'浙江'),
    (u'江西', u'江西'),
    (u'福建', u'福建'),
    (u'湖南', u'湖南'),
    (u'湖北', u'湖北'),
    (u'河南', u'河南'),
    (u'海南', u'海南'),
    (u'广西', u'广西'),
    (u'贵州', u'贵州'),
    (u'四川', u'四川'),
    (u'云南', u'云南'),
    (u'陕西', u'陕西'),
    (u'甘肃', u'甘肃'),
    (u'宁夏', u'宁夏'),
    (u'青海', u'青海'),
    (u'新疆', u'新疆'),
    (u'西藏', u'西藏'),
    (u'重庆', u'重庆'),
    (u'香港', u'香港'),
    (u'台湾', u'台湾'),
    (u'澳门', u'澳门'),
    (u'国外', u'国外'),
)

AREA_CONF_SHENGSHI = (
    (u'北京', [u"北京"]),
    (u'上海', [u"上海"]),
    (u'天津', [u"天津"]),
    (u'重庆', [u"重庆"]),
    (u'香港', [u"香港"]),
    (u'澳门', [u"澳门"]),
    (u'广东', [u'广东', u"深圳市", u"广州市", u"东莞市", u"佛山市", u"珠海市", u"汕头市", u"湛江市", u"江门市", u"韶关市", u"茂名市", u"肇庆市", u"惠州市", u"潮州市", u"中山市", u"汕尾市", u"阳江市", u"河源市", u"梅州市", u"清远市", u"揭阳市", u"云浮市"]),
    (u'河北', [u'河北', u'石家庄市',u'唐山市',u'秦皇岛市',u'邯郸市',u'邢台市',u'保定市',u'张家口市',u'承德市',u'沧州市',u'廊坊市',u'衡水市']),
    (u'山西', [u'山西', u'太原市',u'大同市',u'阳泉市',u'长治市',u'晋城市',u'朔州市']),
    (u'内蒙古', [u'内蒙古',u'呼和浩特市',u'包头市',u'乌海市',u'赤峰市',u'通辽市']),
    (u'辽宁', [u'辽宁', u'沈阳市',u'大连市',u'鞍山市',u'抚顺市',u'本溪市',u'丹东市',u'锦州市',u'营口市',u'阜新市',u'辽阳市',u'盘锦市',u'铁岭市',u'朝阳市',u'葫芦岛市']),
    (u'吉林', [u'吉林', u'长春市',u'吉林市',u'四平市',u'辽源市',u'通化市',u'白山市',u'松原市',u'白城市']),
    (u'黑龙江', [u'黑龙江', u'哈尔滨市',u'齐齐哈尔市',u'鸡西市',u'鹤岗市',u'双鸭山市',u'大庆市',u'伊春市',u'佳木斯市',u'七台河市',u'牡丹江市',u'黑河市']),
    (u'江苏', [u'江苏', u'南京市',u'无锡市',u'徐州市',u'常州市',u'苏州市',u'南通市',u'连云港市',u'淮阴市',u'盐城市',u'扬州市',u'镇江市',u'泰州市',u'宿迁市']),
    (u'浙江', [u'浙江', u'衢州市',u'杭州市',u'湖州市',u'嘉兴市',u'宁波市',u'绍兴市',u'台州市',u'温州市',u'丽水市',u'金华市',u'舟山市',u'兰溪市',u'义乌市']),
    (u'安徽', [u'安徽', u'合肥市',u'芜湖市',u'蚌埠市',u'淮南市',u'马鞍山市',u'淮北市',u'铜陵市',u'安庆市',u'黄山市',u'滁州市',u'阜阳市',u'宿州市',u'巢湖市',u'六安市']),
    (u'福建', [u'福建', u'福州市',u'厦门市',u'莆田市',u'三明市',u'泉州市',u'漳州市',u'南平市',u'龙岩市']),
    (u'江西', [u'江西', u'南昌市',u'景德镇市',u'萍乡市',u'九江市',u'新余市',u'鹰潭市',u'赣州市']),
    (u'山东', [u'山东', u'青岛市',u'济南市',u'烟台市',u'潍坊市',u'临沂市',u'济宁市',u'淄博市',u'威海市',u'东营市',u'日照市',u'泰安市',u'滨州市',u'枣庄市',u'德州市',u'聊城市',u'莱芜市',u'荷泽市']),
    (u'河南', [u'河南', u'郑州市',u'开封市',u'洛阳市',u'平顶山市',u'安阳市',u'鹤壁市',u'新乡市',u'焦作市',u'濮阳市',u'许昌市',u'漯河市',u'三门峡市',u'南阳市',u'商丘市',u'信阳市']),
    (u'湖南', [u'湖南', u'长沙市',u'株洲市',u'湘潭市',u'衡阳市',u'邵阳市',u'岳阳市',u'常德市',u'张家界市',u'益阳市',u'郴州市',u'永州市',u'怀化市',u'娄底市']),
    (u'湖北', [u'湖北', u'武汉市',u'黄石市',u'十堰市',u'宜昌市',u'襄樊市',u'鄂州市',u'荆门市',u'孝感市',u'荆州市',u'黄冈市',u'咸宁市']),
    (u'海南', [u'海南', u'海口市', u'三亚市']),
    (u'广西', [u'广西', u'南宁市',u'柳州市',u'桂林市',u'梧州市',u'北海市',u'防城港市',u'钦州市',u'贵港市',u'玉林市']),
    (u'贵州', [u'贵州', u'贵阳市',u'六盘水市',u'遵义市']),
    (u'四川', [u'四川', u'成都市',u'自贡市',u'攀枝花市',u'泸州市',u'德阳市',u'绵阳市',u'广元市',u'遂宁市',u'内江市',u'乐山市',u'南充市',u'宜宾市',u'广安市',u'达州市']),
    (u'云南', [u'云南', u'昆明市',u'曲靖市',u'玉溪市']),
    (u'陕西', [u'陕西', u'西安市',u'铜川市',u'宝鸡市',u'咸阳市',u'渭南市',u'延安市',u'汉中市',u'榆林市']),
    (u'甘肃', [u'甘肃', u'兰州市',u'嘉峪关市',u'金昌市',u'白银市',u'天水市']),
    (u'宁夏', [u'宁夏', u'银川市',u'石嘴山市',u'吴忠市']),
    (u'青海', [u'青海']),
    (u'新疆', [u'新疆', u'乌鲁木齐市', u'克拉玛依市']),
    (u'西藏', [u'西藏']),
    (u'台湾', [u'台湾', u"台北市", u"台南市", u"台中市", u"高雄市", u"桃源市"]),
    (u'国外', [u'国外']),
    # (u'国外', [u'国外', u'欧洲',u'美洲',u'亚洲',u'非洲',u'法国',u'英国',u'美国',u'日本',u'新加坡',u'以色列',u'丹麦',u'荷兰',u'挪威',u'瑞典',u'瑞士',u'俄罗斯',u'意大利',u'加拿大',u'澳大利亚',u'波兰',u'西班牙',u'智利',u'韩国',u'马来西亚',u'墨西哥',u'巴西',u'南美',u'德国',u'北美',u'阿曼',u'巴林',u'不丹',u'朝鲜',u'老挝',u'蒙古',u'缅甸',u'沙特',u'泰国',u'文莱',u'锡金',u'也门',u'伊朗',u'印度',u'约旦',u'越南',u'阿富汗',u'阿联酋',u'东帝汶',u'菲律宾',u'柬埔寨',u'卡塔尔',u'科威特',u'黎巴嫩',u'尼泊尔',u'土耳其',u'叙利亚',u'伊拉克',u'阿塞拜疆',u'巴基斯坦',u'巴勒斯坦',u'格鲁吉亚',u'马尔代夫',u'孟加拉国',u'塞浦路斯',u'斯里兰卡',u'亚美尼亚',u'哈萨克斯坦',u'塔吉克斯坦',u'土库曼斯坦',u'印度尼西亚',u'吉尔吉斯斯坦',u'乌兹别克斯坦',u'冰岛',u'芬兰',u'捷克',u'希腊',u'爱尔兰',u'安道尔',u'奥地利',u'比利时',u'梵蒂冈',u'立陶宛',u'卢森堡',u'马耳他',u'马其顿',u'摩纳哥',u'葡萄牙',u'乌克兰',u'匈牙利',u'爱沙尼亚',u'白俄罗斯',u'保加利亚',u'克罗地亚',u'拉脱维亚',u'罗马尼亚',u'塞尔维亚',u'黑山',u'波斯尼亚',u'黑塞哥维那',u'古巴',u'海地',u'巴哈马',u'巴拿马',u'伯利兹',u'牙买加',u'巴巴多斯',u'多米尼加',u'多米尼克',u'格林纳达',u'洪都拉斯',u'尼加拉瓜',u'萨尔瓦多',u'圣卢西亚',u'危地马拉',u'哥斯达黎加',u'秘鲁',u'阿根廷',u'巴拉圭',u'圭亚那',u'苏里南',u'乌拉圭',u'玻利维亚',u'厄瓜多尔',u'哥伦比亚',u'委内瑞拉',u'法属圭亚那',u'瑙鲁',u'新西兰',u'埃及',u'贝宁',u'多哥',u'加纳',u'加蓬',u'马里',u'南非',u'苏丹',u'乍得',u'中非',u'安哥拉',u'冈比亚',u'吉布提',u'几内亚',u'喀麦隆',u'科摩罗',u'肯尼亚',u'莱索托',u'利比亚',u'卢旺达',u'马拉维',u'摩洛哥',u'尼日尔',u'索马里',u'乌干达',u'赞比亚',u'津巴布韦',u'利比里亚',u'毛里求斯',u'莫桑比克',u'纳米比亚',u'尼日利亚',u'塞拉利昂',u'塞内加尔',u'坦桑尼亚',u'阿尔及利亚',u'埃塞俄比亚',u'刚果共和国']),
)

# 北京市 　
# 广东省 　
# 山东省 　
# 江苏省 　
# 河南省 　
# 上海市 　
# 河北省 　
# 浙江省 　
# 香港特别行政区 　
# 陕西省 　
# 湖南省 　
# 重庆市 　
# 福建省 　
# 天津市 　
# 云南省 　
# 四川省 　
# 广西壮族自治区 　
# 安徽省 　
# 海南省 　
# 江西省 　
# 湖北省 　
# 山西省 　
# 辽宁省 　
# 台湾省 　
# 黑龙江 　
# 内蒙古自治区 　
# 澳门特别行政区 　
# 贵州省 　
# 甘肃省 　
# 青海省 　
# 新疆维吾尔自治区 　
# 西藏区 　
# 吉林省 　
# 宁夏回族自治区 　